Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.RequestSystemsAnalysis(Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions)
Requests a new systems analysis to be run in the background.
Remarks:
Should be called from a transaction.
options:
The additional options to run systems analysis. If empty, use the default value in the view element.
The request may download the weather file at current site location if not specified in the options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
No weather station is within 500 nautical miles of this site location.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Fail to download the weather file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A valid energy model is required for systems analysis.
-or-
Unable to export the gbxml file or access the weather service.
Since:
2020.1

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.SystemsAnalysisOutputFolder
The full path of the output folder for systems analysis.
Since:
2020.1